{
  "testimonials": [
    {
      "title": "The workmanship is second to none...",
      "text": "My wife and I had our bungalow converted to a house by JG. We were told that the works would take about 10 weeks but were actually completed ahead of schedule in about 8 weeks. The level of workmanship was second to none and they were always professional.\nThey made some recommendations along the way in respect of the construction and we could not be more pleased with the results.\nThey completed the internal staircase work whilst we were away on holiday and we returned home to a clean house!\nI would not hesitate in recommending them and have already done so to friends and family.",
      "author": "Paul Kirby"
    },
    {
      "title": "Respectable, professional, honest and trustworthy...",
      "text": "We gave JG the keys to our property when we went to work, and knew them to be honest and trustworthy at all times.\nWe have used the company on two separate occasions and both times have been extremely pleased with all of the work carried out.\nJG were very professional and very punctual at all times. They carried out all work in the specified time estimated and met all deadlines.\nIf you would like any further information, please do not hesitate to contact us.",
      "author": "J.A. and G.H.J. Moulton"
    },
    {
      "title": "Highly recommend JG Design and Build to you",
      "text": "I have had substantial building work carried out by JG Design and Build. They completely built a three room extension to my home including all services earlier this year.\nI found them to be reliable, punctual, honest and very clean workers. I am completely satisfied with the work they have carried out and would use them again.\nI highly recommend them to you.",
      "author": "Mrs M Frith"
    },
    {
      "title": "Recommended to anyone seeking honest, quality assured work on their home",
      "text": "We hired JG to plan and build an ensuite and extra bedroom above our garage. From the outset the project was very well handled with regard to timing and professionalism. The work team were very prompt every morning and always made a very conscious effort to tidy the site at the end of the day. The work was completed to a very high standard, in the estimated time frame and we were delighted with the results. We have since used the guys for some smaller internal work around the house and once more the results were top class.\nWe would have no hesitation in recommending JG to friends and family for any future work, or indeed to any person seeking honest, quality, assured work on their home.",
      "author": "Phil Langridge"
    },
    {
      "title": "The project management displayed was excellent.",
      "text": "JG Design and Build were engaged to undertake the demolition of an existing side extension and the constructions of a new two storey extension in September 2008, comprising of; an enlarged kitchen, new lounge, utility room, downstairs toilet, two new double bedrooms, one with ensuite and remedial works within the existing property.\nAs the client, we had supplied our own drawings. With hindsight, I would recommend that JG Design and Build would undertake these works as they are well placed to ensure that all the client’s requirements are included in the necessary drawings.\nThe project management displayed was excellent. This was a challenging project in that the works had to be constructed around our existing household prior to knocking through into the existing property all the time under the scrutiny of a well informed client.\nThe workmanship displayed was of a very high standard and as the client we were kept very well informed and were guided through the necessary changes due to the nature of the very poor information we had provided via our surveyor.\nI was extremely impressed at the standard of housekeeping displayed by all the trades. Construction work is stressful enough without having lots of mess and debris in the house. JG Design and Build deserve a special mention in this area in that the team kept the whole house really tidy and as dust free as possible during the whole project, an extreme rarity these days in the construction industry.\nWe had anticipated that a project of this nature would take approximately 20 weeks causing us disruption through Christmas 2008. I am very pleased to say that JG completed the whole of the works in an impressive 14 weeks.\nI would have no hesitation in recommending JG Design and Build to anyone who is considering building works, they are rare true professionals and I would have no hesitation in engaging their services again.",
      "author": "Ian Simmonds. Senior Project Manager, London 2012"
    },
    {
      "title": "I can honestly say JG were the best...",
      "text": "My husband and I had our bungalow converted to a chalet by JG Design and Build during Aug – Oct 2002. We did not move out whilst this major project took place. The work took eleven weeks from start to finish.\nWe had scaffolding erected with a cover as the roof came completely off. They were extremely efficient; there was no going off to work on other jobs. The workmen they used were all very good, all treating us and our home with a great deal of respect. We had a crane to install girders at our point completely closing our road for a few hours. John liaised with our neighbours, one who has always been troublesome since we have lived here, but because they were considerate and discussed it with them there was no problem at all.\nWe were left safe and secure every night and neat and tidy – since we have been married we have had five different extensions on various homes, so we are used to builders. I can honestly say these were the best. It was a pleasure having them work for us and I would highly recommend them to anyone.\nTheir work is of a very high standard and if it would help in any way you are welcome to telephone us if you have any queries, or come to see their work.",
      "author": "Brenda and Mike Hammond"
    },
    {
      "title": "First class professional service",
      "text": "JG Design and Build provided us with a first class professional service and we were delighted with the results of our bungalow conversion. Everything went according to their meticulous time schedule and the whole project was completed within 10 weeks which was better than the 3 to 4 months we originally had expected.\nThey introduced themselves to all our neighbours before the works commenced and asked them not to hesitate to say should there be any inconvenience to them, there were no problems at all.\nWe were particularly pleased when on changing our minds about a few things, they did not flinch at the prospect of making changes to work already done. They were very accommodating to us when we didn’t know in our own minds a few details.\nThey were on site early every morning until evening with no “shooting off to other jobs”. Their whole team of electricians, plumbers, plasterers, roofers, groundsmen etc. were very polite and courteous and we would be only too happy to recommend them to anyone.\nThe work carried out is to a very high standard and we would welcome anyone who would like to see or discuss the finished project.",
      "author": "Paul and Dinky Manning"
    },
    {
      "title": "First class service, courteous and genuine professionals",
      "text": "We would like to express our thanks for the extension you have completed on our house. From start to finish the approach was professional and the quality of work excellent. Every little detail was catered for and the communication during the project was first class. Please pass on our thanks to everyone involved. Not only did they all carry out their individual jobs professionally, they were all courteous and genuine people. If we decide to have any further work carried out we would not hesitate to call you. Thanks again JG for a brilliant job!",
      "author": "Graham and Lynn"
    },
    {
      "title": "We are absolutely delighted with our new home.",
      "text": "A big thank you to you and your amazing team, we are absolutely delighted with our new home!\nWe both want to say how brilliant you've been from start to finish, in making everything run smoothly and how you've always been so helpful and approachable.\nWe wouldn't hesitate in recommending your professional and efficient service to everyone we know!",
      "author": "Yas and Ian"
    },
    {
      "title": "A happy customer",
      "text": "My husband and I had a dream to buy an old bungalow and renovate it. We found the perfect bungalow, now it was time to find the perfect builders.....\nJG Design and build were amazing!! They knocked the bungalow down all apart from two walls and rebuilt it. They were very professional, clean and tidy, punctual, efficient and nothing was too much trouble.\nThey worked with us as we rebuilt the house, giving us expert advice, using their 30 years experience. I would highly recommend them and would now only ever use them in the future. They built our 5 bedroom 6 bathroom house on time, on budget and just under 6 months from start to finish, With not one single problem or issue!!!\nThe house is better than we could of ever imagined. As you can see from the pictures, PERFECT!",
      "author": "Dean and Alison"
    },
    {
      "title": "We cannot thank John and his team enough",
      "text": "We cannot thank John and his team enough for the excellent and professional work carried out on our new single storey extenson and kitchen to our bungalow over the last couple of months. Totally exceeded our expectations and couldn't be happier. The team were friendy, cheerful and polite every day. The attention to detail is exceptional. Always in contact and helped immensley with guiding us throughout the whole process. Every day the team cleaned up after themselves making things so much easier for us. We now have a faulous new extension and kitchen to be proud of. We would thoroughly recommend John (JG Design and Build Ltd) and his team and look forward to futher projects in the future.\nThank you so much John and the dogs say 'hello'\nAll the best until the next project",
      "author": "Carol and Alan"
    },
    {
      "title": "Thanks for transforming...",
      "text": "Thanks to John and his team for transforming our tired old bungalow to a modern magnificent new home for us. Best wishes",
      "author": "Glynis and Colin Jones"
    },
    {
      "title": "Very happy clients!",
      "text": "We appointed JG Design and Build to carry out an extensive renovation and building project and we could not be more pleased with the results.\nStarting with a dated 3 bedroom end of terrace house with a part integral garage and a large plot to the side, JG realised our vision and dreams and transformed our house into a beautiful 5 bedroom property by building a double storey side extension housing our new master bedroom with large en-suite, utility room, ground floor shower and WC and a large garage whilst renovations to the existing property included being completely re-wired and a whole new heating system being installed. The existing garage was converted into a guest bedroom and the entrance hallway was completely remodelled. There was an existing ‘lean to’ conservatory and utility room which was demolished and replaced with a single storey extension across the back of the house which together with the demolishment of several internal walls, created a large extended lounge and open plan kitchen with a vaulted ceiling to the rear.\nJG Design and Build were extremely considerate of our wishes and needs and advised us where we were unsure. From the drawings, planning and building regulations procedure right through to completion JG Design and Build were working for us all the way. Right from the get go, they were extremely hardworking, reliable, punctual, dependable and outstanding in every respect! Ours was a major project and we were understandably very keen to see what progress had been made each day so we were on site every working day (not because we needed to be but because we wanted to be). We were literally excited to get home just to see what had been done each day and we were never disappointed. It is fair to say that we were amazed everyday at the progress made and how much had been done. We were also very impressed at how neat and tidy our building site was kept. We knew very early on in the project that we had chosen a very good trustworthy building company. In particular, John project managed the entire build from planning to completion in the most efficient way and arranged for all the materials and different trades to be on site only when needed. This efficient organisation saw our project being completed in a very impressive 12-13 weeks which meant everyone could move back home in time for Christmas.\nThroughout the entire project JG Design and Build kept us informed and updated and pointed out any potential problems that may arise so that we were aware. They steered us successfully through the entire procedure without any added stress. They were very aware of not only our needs but those of our neighbours and were extremely considerate to everyone. It is our pleasure to recommend JG Design and Build and their entire team which includes all of the different tradesmen to any potential new clients. In fact we have already highly recommended them to several people.\nWe are now the very proud owners of an impressive property which has attracted many comments and praise from our family, friends and neighbours and we are very pleased with everything that they have done for us. We know that no problem is too small for them and they pride themselves, quite rightly so, on providing a complete building service that is second to none. We would happily welcome anyone considering appointing JG Design and Build into our home to look at the work they carried out on our property by prior arrangement via one of their team.\nVery happy clients",
      "author": "Dave and Lesley"
    }
  ]
}
